import React from 'react';
import PropTypes from 'prop-types';
import './Javascript.css';

const Javascript = props => {
  console.log(props);
  return (
    <div className="container">
      <h2 className="title">Javascript</h2>
      <p className="text">
        JavaScript (JS) — динамічна, об'єктно-орієнтована[4] прототипна мова
        програмування. Реалізація стандарту ECMAScript. Найчастіше
        використовується для створення сценаріїв веб-сторінок, що надає
        можливість на стороні клієнта (пристрої кінцевого користувача)
        взаємодіяти з користувачем, керувати браузером, асинхронно обмінюватися
        даними з сервером, змінювати структуру та зовнішній вигляд веб-сторінки.
        JavaScript класифікують як прототипну (підмножина
        об'єктно-орієнтованої), скриптову мову програмування з динамічною
        типізацією. Окрім прототипної, JavaScript також частково підтримує інші
        парадигми програмування (імперативну та частково функціональну) і деякі
        відповідні архітектурні властивості, зокрема: динамічна та слабка
        типізація, автоматичне керування пам'яттю, прототипне наслідування,
        функції як об'єкти першого класу.
      </p>
    </div>
  );
};

Javascript.propTypes = {
  // bla: PropTypes.string,
};

Javascript.defaultProps = {
  // bla: 'test',
};

export default Javascript;
